{
	"addons": {
		"addon": {
			"kind": "mod",
			"versions": [
				{
					"content_versions": "2.0.1",
					"minecraft_versions": "1.19.2",
					"modloaders": "quilt",
					"relations": {
						"dependencies": [
							"fabriclike-api",
							"geckolib",
							"trinkets"
						]
					},
					"stability": "stable",
					"url": "https://cdn.modrinth.com/data/Jjc1149h/versions/fKAvwKdl/ratsmischief-2.0.1.jar",
					"version": "fKAvwKdl"
				},
				{
					"content_versions": "2.0",
					"minecraft_versions": "1.19.2",
					"modloaders": "quilt",
					"stability": "stable",
					"url": "https://cdn.modrinth.com/data/Jjc1149h/versions/2kkkXRjU/ratsmischief-2.0.jar",
					"version": "2kkkXRjU"
				},
				{
					"content_versions": "1.4.0",
					"minecraft_versions": [
						"1.19",
						"1.19.1",
						"1.19.2"
					],
					"modloaders": [
						"fabriclike",
						"quilt"
					],
					"stability": "stable",
					"url": "https://cdn.modrinth.com/data/Jjc1149h/versions/TO8D9XBT/ratsmischief-1.4.0.jar",
					"version": "TO8D9XBT"
				}
			]
		}
	},
	"meta": {
		"authors": [
			"AmyMialee",
			"Arathain",
			"Luxintrus",
			"Pyrofab",
			"RAT"
		],
		"community": "https://ladysnake.glitch.me",
		"description": "Adds rats to Minecraft: smart, versatile and adorable pets!",
		"documentation": "https://ladysnake.github.io/wiki/rats-mischief",
		"gallery": [],
		"icon": "https://cdn.modrinth.com/data/Jjc1149h/7fa816009307b2b11e0249e9647444432ec20a71.png",
		"issues": "https://github.com/Ladysnake/Rats-Mischief/issues",
		"license": "LicenseRef-All-Rights-Reserved",
		"long_description": "![Image](https://github.com/Ladysnake/RATs-Mischief/blob/main/title.png?raw=true)\n\n\n### A Quilt mod adding Rats to Minecraft as companions, helpers and friends.\n\nThe mod adds a new pettable mob: Rats. These new little critters can and will follow you, defend you and accomplish many tasks for you.\n\n## [Video showcase on a Minecraft SMP (RAT's Mischief 2.0)](https://www.youtube.com/watch?v=O5e930bA4yg)\n\n## Gallery\n![Image](https://github.com/Ladysnake/RATs-Mischief/blob/main/gallery/rats.png?raw=true)\n\n![Image](https://github.com/Ladysnake/RATs-Mischief/blob/main/gallery/gear.png?raw=true)\n\n![Image](https://github.com/Ladysnake/RATs-Mischief/blob/main/gallery/named.png?raw=true)\n\n\n## Current features:\n### Rats:\n- A new pettable mob found in non-naturally abandoned villages. If a village happens to no longer have any villagers, rats will start spawning there and wander around\n- Default Rat colour is wild, but fancy Rat colour can be obtained from breeding them\n- Just like any other pettable mob, Rats will fight for you. They deal close to no damage by themselves, but given they do not trigger invulnerability frames, they get deadlier the more they are\n- Rats will fetch any dropped item and bring it back directly to their owner (can be disabled by right clicking a Rat Master Ocarina). If their owners inventory is full they will keep the item in their hands until some space in the inventory is cleared\n- Can be picked up and held in your hand. Dropping a rat as an item will spawn back the rat instead\n- When held in hand, Rats can be placed back down or thrown, and if aimed at a mob, stick on top of it to attack them\n- Right clicking a Rat in your inventory will set them to return to you and get back to your inventory automatically after being thrown\n- **Plague Rats**: when two Rats affected with the same potion effect breed, the offspring has a chance to be a Plague Rat\n    - Plague Rats cannot be affected by their carried effect, but will transfer that effect to entities they attack.\n    - Combine this mechanic with the throwing mechanic to use Plague Rats with negative or positive potion effects, respectively as an offense or support tool\n- **Spy Rats**: combining a Rat (as an item) with an Ender Eye and Rabbit Hide allows you to equip said rat as a Spy Rat, a rat that can be remote controlled using a Rat Master Mirror\n- Some easter egg Rat names offer a different appearance for your rats: \"Rat Kid\" (Hat in Time reference, dyes can be used on Rat Kids to change their outfit), \"doctor4t\", \"astronyu\", \"Remy\" (Ratatouille), \"Ratater\", \"Jerma\" and \"Biggie Cheese\"\n\n### Items:\n- Rat Pouches\n    - Can be used to retrieve and carry around a group of rats\n    - Currently 4 materials, the better the material the higher the capacity: Leather (5), Twisted (10), Purpur (15), Rat Master (20)\n    - All pouches can be crafted using the bundle pattern with their respective materials, except Rat Master which has to be obtained by combining a Purpur Pouch with a Clothed Ingot in a Smithing Table\n- Clothed Ingot\n    - The main material to craft Rat Master gear and armor. Can be obtained in Ancient City loot chests\n- Rat Master Armor\n    - An armor set with Diamond level protection, specifically designed to use Rats with a \"summoner\" playstyle\n    - Allows the wearer to choose a bonus for each piece worn by right clicking them. Current bonuses are:\n        - 15% increased Rat damage resistance\n        - 25% increased Rat attack damage\n        - 25% increased Rat mining speed\n    - Hood and pauldrons can be visually toggled by shift right clicking on the Hood and Cloak items\n    - Wearing a full set prevents a player from hurting their own Rats\n    - Can be obtained by combining Diamond Armor pieces with a Clothed Ingot in a Smithing Table\n- Rat Master Mask\n    - Prevents the wearer from hurting their own Rats\n    - Hides the wearer's name tag\n    - Can be obtained by combining a Skeleton Skull with a Clothed Ingot in a Smithing Table\n- Curse of the Rat\n    - Curse of the Rat books can be found exclusively in Ancient City loot chests, and can be applied to Rat Master Armor pieces and the Rat Master Mask\n    - Causes a player to automatically transform into a Rat to flee combat whenever their health drops below 4 hearts. Duration of the Rat effect lasts 10 seconds per Cursed piece\n- Rat Master Ocarina\n    - Can be used to give order to Rats. Sneak use to change order and use to give order. Current orders are:\n        - Harvest mature crops and plant held vegetable / seeds\n        - Mine and collect the block type the Ocarina was used on\n        - Attack all hostile entities on sight\n        - Breed animals that can be bred with the item each Rat is currently holding (including Rats)\n    - Right click in the inventory to toggle Rats bringing dropped items\n    - Can be obtained by combining a Goat Horn with a Clothed Ingot in a Smithing Table\n- Rat Master Mirror\n    - Combining a Rat (as an item) with an Ender Eye and Rabbit Hide allows you to equip said rat as a Spy Rat, a rat that can be remote controlled using a Rat Master Mirror\n    - Can be obtained by combining an Ender Eye with a Clothed Ingot in a Smithing Table\n\n\n\n## FAQ\n\n#### Q: Why Quilt? Why not Forge or Fabric?\n\n**A: Short answer:** some utilities and libraries I need for my mods are only available for Quilt. I also do not wish to continue supporting loaders led by transphobes / racists / horrible people in general, especially when a better product like Quilt exists. If you want the long version of it, it's here.\n\n<details>\n<summary>Now if you want the long version...</summary>\n\nI don't have any problem dissociating a project from the person behind it when that project is the best there is, however, Fabric's lead dev's transphobia genuinely got in the way of code contributions that would've been great additions to the loader's API (these contributions being made by trans people). Certain systems like the custom biome, dimension or multipart APIs of Fabric have a lot of problems and sometimes straight up don't work, while these issues have been fixed on Quilt.\n\nFor Forge, it's not so much about the devs being bad people, it's more that the way Forge does things and forces modders to do things in a particular (and in my opinion, complicated) way genuinely got me to quit modding before I switched to Fabric when it first came out. On top of that, Forge devs have in the past caused me and my friends quite a bit of trouble and unfortunate interactions, and when I did allow Forge ports of my mods to be made, I would have people come to me regarding issues on the Forge version, which I had nothing to do with.\n\nAdditionally, Quilt has a bigger team, and I personally know most of the devs. Therefore, I can also try to help by directly giving feedback or contributions to them if need be, unlike with Fabric or Forge. To also quote a friend I completely agree with: \"The argument of \"X modloader has no popular mods ergo no popular mods should move to it\" is circular and, to put it bluntly, a tad idiotic. I've heard it with Fabric before, and as I did not listen previously I will not listen now. Quilt is a modloader that I can trust the development team of, and thus I develop on it.\"\n\nIf you're upset about the mod not being available to you because you don't wanna use Quilt, I can understand that. However, please also understand that if it weren't for Quilt, I probably wouldn't have updated my mod anyway, so you're technically not missing out on anything! Ultimately, whether or not you want to use this mod is entirely your choice, so do not play victim and put the blame on me if you do not wish to go through the steps to play with it.\n\nFinally, I mod for myself above all, releasing my mods is just a bonus I provide for free. This is a hobby that should stay enjoyable, and altough I'm trying my best to keep it that way, it's becoming harder and harder as time passes due to entitled players and the incredibly toxic modding community. This is my work, my mod, and I am free to do whatever I want with it. If I don't want it to be available for loaders I dislike and don't want to support, I am free to make that choice without having to justify it. However, I still hope this explanation gives a little more insight and helps you understand!\n\n🐀❤️\n\n</details>\n\n#### Q: But I really wanna play with this mod and I play on Fabric!\n\n**A: You can run Fabric mods on Quilt**. 99% of Fabric mods run perfectly on Quilt, so if you wanna use this mod alongside Fabric ones, consider switching. It's not as big of a task to move as it seems. If you find an incompatibility from a Fabric mod on Quilt, [you can report it here](https://forum.quiltmc.org/t/mod-incompatibility-megathread/261) and the Quilt team will do its best.\n\n#### Q: Can I port this mod to Forge / Fabric?\n\n**A: No**. I am not comfortable with ports of my mod being made for other loaders I do not wish to support, for the reason listed above.\n\n#### Q: Can I port this mod to Bedrock?\n\n**A: Yes**. Unlike Fabric or Forge, if you wish to make a version of this mod for Minecraft Bedrock edition, I do not have an issue with it. However, please contact me first to get proper written permission.\n\n#### Q: Can you backport this mod to 1.x? When will you update to 1.x?\n\n**A: No**. I mod Minecraft as a hobby with very limited time. Therefore, I will not backport this mod to older versions of Minecraft, and I will update it to future versions when I feel like it. If you want it updated to newer versions, feel free to contribute to the mod and make a pull request, it's appreciated! Otherwise, don't come begging.\n\n#### Q: Can I include this mod in a modpack?**\n\n**A: Yes** you can. Go ahead, don't bother asking. Please however provide credit and a link to either the GitHub repository, Modrinth or CurseForge project page.\n\n###### Copyright (C) 2023 Ladysnake\n",
		"name": "RAT's Mischief",
		"package_maintainers": [
			"mcvm"
		],
		"source": "https://github.com/Ladysnake/Rats-Mischief"
	},
	"properties": {
		"content_versions": [
			"2.0.1",
			"2.0",
			"1.4.0"
		],
		"modrinth_id": "Jjc1149h",
		"supported_modloaders": [
			"fabriclike"
		],
		"supported_sides": [
			"client",
			"server"
		],
		"supported_versions": [
			"1.19",
			"1.19.1",
			"1.19.2"
		]
	}
}